espressif/esp-idf/components/soc/esp32h4/register/soc/gpio_ext_reg.h
/** GPIO_EXT_PIN_CTRL_REG register
 *  Clock Output Configuration Register
 */
 #define GPIO_EXT_PIN_CTRL_REG (DR_REG_GPIO_EXT_BASE + 0x1e0)
 /** GPIO_EXT_CLK_OUT1 : R/W; bitpos: [4:0]; default: 0;
  *  If you want to output clock for I2S to CLK_OUT_out1, set this register to 0x0.
  *  CLK_OUT_out1 can be found in peripheral output signals.
  */
 #define GPIO_EXT_CLK_OUT1    0x0000001FU
 #define GPIO_EXT_CLK_OUT1_M  (GPIO_EXT_CLK_OUT1_V << GPIO_EXT_CLK_OUT1_S)
 #define GPIO_EXT_CLK_OUT1_V  0x0000001FU
 #define GPIO_EXT_CLK_OUT1_S  0
 /** GPIO_EXT_CLK_OUT2 : R/W; bitpos: [9:5]; default: 0;
  *  If you want to output clock for I2S to CLK_OUT_out2, set this register to 0x0.
  *  CLK_OUT_out2 can be found in peripheral output signals.
  */
 #define GPIO_EXT_CLK_OUT2    0x0000001FU
 #define GPIO_EXT_CLK_OUT2_M  (GPIO_EXT_CLK_OUT2_V << GPIO_EXT_CLK_OUT2_S)
 #define GPIO_EXT_CLK_OUT2_V  0x0000001FU
 #define GPIO_EXT_CLK_OUT2_S  5
 /** GPIO_EXT_CLK_OUT3 : R/W; bitpos: [14:10]; default: 0;
  *  If you want to output clock for I2S to CLK_OUT_out3, set this register to 0x0.
  *  CLK_OUT_out3 can be found in peripheral output signals.
  */
 #define GPIO_EXT_CLK_OUT3    0x0000001FU
 #define GPIO_EXT_CLK_OUT3_M  (GPIO_EXT_CLK_OUT3_V << GPIO_EXT_CLK_OUT3_S)
 #define GPIO_EXT_CLK_OUT3_V  0x0000001FU
 #define GPIO_EXT_CLK_OUT3_S  10

/** GPIO_EXT_VERSION_REG register
 *  Version control register
 */
#define GPIO_EXT_VERSION_REG (DR_REG_GPIO_EXT_BASE + 0x1fc)
/** GPIO_EXT_DATE : R/W; bitpos: [27:0]; default: 37818704;
 *  Version control register.
 */
#define GPIO_EXT_DATE    0x0FFFFFFFU
#define GPIO_EXT_DATE_M  (GPIO_EXT_DATE_V << GPIO_EXT_DATE_S)
#define GPIO_EXT_DATE_V  0x0FFFFFFFU
#define GPIO_EXT_DATE_S  0

#ifdef __cplusplus
}
#endif
